# Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.3.2'

### 1. Introduction into Pandas

In [3]:
# Series

a = pd.Series([11, 28, 72, 3, 5, 8])
b_1 = ['apples', 'oranges', 'cherries', 'pears']
b_2 = ['apples', 'oranges', 'cherries', 'portakal']
c = pd.Series([1,2,3,4], index=b_1)
d = pd.Series([11,12,13,14], index=b_2)

print(a.index, "\n")
print(a.values, "\n")
print(c, "\n")
print(c + d)

RangeIndex(start=0, stop=6, step=1)

[11 28 72  3  5  8]

apples      1
oranges     2
cherries    3
pears       4
dtype: int64

apples      12.0
cherries    16.0
oranges     14.0
pears        NaN
portakal     NaN
dtype: float64

In [4]:
# Indexing

a = pd.Series([1,2,3,4], index=b_1)
print(a['apples'], "\n")
print(a[['apples', 'oranges', 'cherries']], "\n")
print((a + 3) * 4 , "\n")
print(np.sin(a))

1

apples      1
oranges     2
cherries    3
dtype: int64

apples      16
oranges     20
cherries    24
pears       28
dtype: int64

apples      0.841471
oranges     0.909297
cherries    0.141120
pears      -0.756802
dtype: float64

In [5]:
# pandas.Series.apply

print( a.apply( np.log ), "\n" )
print( a.apply( lambda x: x if x > 50 else x + 10 ) )

apples      0.000000
oranges     0.693147
cherries    1.098612
pears       1.386294
dtype: float64

apples      11
oranges     12
cherries    13
pears       14
dtype: int64

In [6]:
# Filtering with a Boolean array

print( a[ a>2 ] )
print( "apples" in a )

cherries    3
pears       4
dtype: int64
True

In [7]:
# Creating Series Objects from Dictionaries

cities = {"London":    8615246, 
          "Berlin":    3562166, 
          "Madrid":    3165235,
          "Budapest":  1754000,
          "Warsaw":    1740119,
          "Barcelona": 1602386,
          "Munich":    1493900,
          "Milan":     1350680}

city_series = pd.Series(cities)
print(city_series)

London       8615246
Berlin       3562166
Madrid       3165235
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
dtype: int64

In [8]:
# NaN - Missing Data, The Methods isnull() and notnull()

my_cities = ["London", "Paris", "Zurich", "Berlin", "Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, index=my_cities)
print( my_city_series, "\n" )
print( my_city_series.isnull(), "\n" )
print( my_city_series.notnull() )

London       8615246.0
Paris              NaN
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg            NaN
dtype: float64

London       False
Paris         True
Zurich        True
Berlin       False
Stuttgart     True
Hamburg       True
dtype: bool

London        True
Paris        False
Zurich       False
Berlin        True
Stuttgart    False
Hamburg      False
dtype: bool

In [9]:
# Filtering out Missing Data

print( my_city_series, "\n")
print( my_city_series.dropna(), "\n" )
print( my_city_series.fillna(0), "\n" )
print( my_city_series.fillna( {"Stuttgart":597939, "Zurich":378884} ).fillna(0) )

London       8615246.0
Paris              NaN
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg            NaN
dtype: float64

London    8615246.0
Berlin    3562166.0
dtype: float64

London       8615246.0
Paris              0.0
Zurich             0.0
Berlin       3562166.0
Stuttgart          0.0
Hamburg            0.0
dtype: float64

London       8615246.0
Paris              0.0
Zurich        378884.0
Berlin       3562166.0
Stuttgart     597939.0
Hamburg            0.0
dtype: float64

### 2. Pandas DataFrame

In [35]:
# Dataframes and Series

indexes = range(2014, 2018)

a = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=indexes)
b = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=indexes)
c= pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=indexes)

d = pd.concat([a, b, c], axis=1)
d

            0        1        2
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

In [37]:
column_names = ["col1", "col2", "col3"]
d.columns = column_names
d

         col1     col2     col3
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

In [84]:
# DataFrames from Dictionaries

cities = {"name": ["London", "Berlin", "Madrid", "Rome", "Paris", "Vienna", "Bucharest" ],
          "population": [8615246, 3562166, 3165235, 2874038, 2273305, 1805681, 1803425 ],
          "country": ["England", "Germany", "Spain", "Italy", "France", "Austria", "Romania" ]}

city_frame = pd.DataFrame(cities)
print( city_frame.columns.values )
city_frame

['name' 'population' 'country']

        name  population  country
0     London     8615246  England
1     Berlin     3562166  Germany
2     Madrid     3165235    Spain
3       Rome     2874038    Italy
4      Paris     2273305   France
5     Vienna     1805681  Austria
6  Bucharest     1803425  Romania

In [104]:
# Custom index

ordinals = ["first", "second", "third", "fourth", "fifth", "sixth", "seventh"]
city_frame = pd.DataFrame(cities, index=ordinals)
print( city_frame )

              name  population  country
first       London     8615246  England
second      Berlin     3562166  Germany
third       Madrid     3165235    Spain
fourth        Rome     2874038    Italy
fifth        Paris     2273305   France
sixth       Vienna     1805681  Austria
seventh  Bucharest     1803425  Romania

In [132]:
# Rearranging the Order of Columns

city_frame = pd.DataFrame(cities, columns=["name", "country", "population"])
city_reordened = city_frame.reindex(index=[0, 2, 4, 6, 1, 3, 5], columns=['country', 'name', 'population'])
print( city_reordened, "\n" )
city_reordened.rename(columns={"name": "name1", "country":"country1", "population":"population1"}, inplace=True)
city_reordened

   country       name  population
0  England     London     8615246
2    Spain     Madrid     3165235
4   France      Paris     2273305
6  Romania  Bucharest     1803425
1  Germany     Berlin     3562166
3    Italy       Rome     2874038
5  Austria     Vienna     1805681

  country1      name1  population1
0  England     London      8615246
2    Spain     Madrid      3165235
4   France      Paris      2273305
6  Romania  Bucharest      1803425
1  Germany     Berlin      3562166
3    Italy       Rome      2874038
5  Austria     Vienna      1805681

In [148]:
# Existing Column as the Index of a DataFrame

city_frame = pd.DataFrame(cities, columns=["name", "population"], index=cities["country"])
print(city_frame)

city_frame = pd.DataFrame(cities)
city_frame.set_index("country", inplace=True)
city_frame

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425

              name  population
country
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425

In [177]:
# Accessing Rows via Index Values

city_frame = pd.DataFrame(cities, columns=("name", "population"), index=cities["country"])
print( city_frame.loc[['Germany', 'France']] )

condition = city_frame['population'] > 2000000
print( city_frame[condition], "\n" )

print(city_frame['name'].str.contains("m"))
print(city_frame.loc[(city_frame['name'].str.contains("a")) & (city_frame.population>2000000)])

           name  population
Germany  Berlin     3562166
France    Paris     2273305
           name  population
England  London     8615246
Germany  Berlin     3562166
Spain    Madrid     3165235
Italy      Rome     2874038
France    Paris     2273305

England    False
Germany    False
Spain      False
Italy       True
France     False
Austria    False
Romania    False
Name: name, dtype: bool
          name  population
Spain   Madrid     3165235
France   Paris     2273305

In [192]:
# Adding Rows to a DataFrame and Accessing by Position

city_frame.iloc[-1] = ["Milan", 1399860]
city_frame.loc['Switzerland'] = ['Zurich', 415215]
print( city_frame )

city_frame.iloc[[3,2,0,5,0]]

               name  population
England      London     8615246
Germany      Berlin     3562166
Spain        Madrid     3165235
Italy          Rome     2874038
France        Paris     2273305
Austria      Vienna     1805681
Romania       Milan     1399860
Switzerland  Zurich      415215

           name  population
Italy      Rome     2874038
Spain    Madrid     3165235
England  London     8615246
Austria  Vienna     1805681
England  London     8615246

In [226]:
# Sum and Cumulative Sum

years = range(2014, 2019)
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken"]
shops = pd.DataFrame(index=years)
for city in cities:
    shops.insert(loc=len(shops.columns),
                 column=city,
                 value=(np.random.uniform(0.7, 1, (5,)) * 1000).round(2))

print(shops, "\n")
print(shops.sum(), "\n")
print(shops.sum(axis=1), "\n")
print(shops.iloc[:, [0,2,-1]].sum(), "\n")
print(shops.iloc[:, [0,2,-1]].cumsum())

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  736.90    895.49   730.10    823.06       999.15
2015  895.30    838.53   805.06    910.69       756.17
2016  724.91    769.12   875.52    878.90       825.91
2017  711.43    751.80   783.84    700.69       774.78
2018  738.11    992.50   939.30    990.33       896.43

Zürich         3806.65
Freiburg       4247.44
München        4133.82
Konstanz       4303.67
Saarbrücken    4252.44
dtype: float64

2014    4184.70
2015    4205.75
2016    4074.36
2017    3722.54
2018    4556.67
dtype: float64

Zürich         3806.65
München        4133.82
Saarbrücken    4252.44
dtype: float64

       Zürich  München  Saarbrücken
2014   736.90   730.10       999.15
2015  1632.20  1535.16      1755.32
2016  2357.11  2410.68      2581.23
2017  3068.54  3194.52      3356.01
2018  3806.65  4133.82      4252.44

In [227]:
# Assigning New Columns

cities = {"name": ["London", "Berlin", "Madrid", "Rome", 
                   "Paris", "Vienna", "Bucharest", "Hamburg"],
          "population": [8615246, 3562166, 3165235, 2874038,
                         2273305, 1805681, 1803425, 1760433],
          "country": ["England", "Germany", "Spain", "Italy",
                      "France", "Austria", "Romania", "Germany"]}

city_frame = pd.DataFrame(cities,
                          columns=["country", 
                                   "population",
                                   "cum_population"],
                          index=cities["name"])
city_frame["cum_population"] = city_frame["population"].cumsum()
city_frame["area"] = [1572, 891.85, 605.77, 1285, 105.4, 414.6, 228, 755]
city_frame

           country  population  cum_population     area
London     England     8615246         8615246  1572.00
Berlin     Germany     3562166        12177412   891.85
Madrid       Spain     3165235        15342647   605.77
Rome         Italy     2874038        18216685  1285.00
Paris       France     2273305        20489990   105.40
Vienna     Austria     1805681        22295671   414.60
Bucharest  Romania     1803425        24099096   228.00
Hamburg    Germany     1760433        25859529   755.00

In [228]:
# Sorting DataFrames

city_frame = city_frame.sort_values(by="area", ascending=False)
city_frame

           country  population  cum_population     area
London     England     8615246         8615246  1572.00
Rome         Italy     2874038        18216685  1285.00
Berlin     Germany     3562166        12177412   891.85
Hamburg    Germany     1760433        25859529   755.00
Madrid       Spain     3165235        15342647   605.77
Vienna     Austria     1805681        22295671   414.60
Bucharest  Romania     1803425        24099096   228.00
Paris       France     2273305        20489990   105.40

In [229]:
city_frame.insert(loc=1, column='new_column', value=[1,2,3,4,5,6,7,8])
city_frame

           country  new_column  population  cum_population     area
London     England           1     8615246         8615246  1572.00
Rome         Italy           2     2874038        18216685  1285.00
Berlin     Germany           3     3562166        12177412   891.85
Hamburg    Germany           4     1760433        25859529   755.00
Madrid       Spain           5     3165235        15342647   605.77
Vienna     Austria           6     1805681        22295671   414.60
Bucharest  Romania           7     1803425        24099096   228.00
Paris       France           8     2273305        20489990   105.40

In [231]:
df = pd.DataFrame(columns=['lib', 'qty1', 'qty2'])
for i in range(5):
     df.loc[i] = ['name' + str(i)] + list(np.random.randint(10, size=2))
    
df

     lib  qty1  qty2
0  name0     3     5
1  name1     3     9
2  name2     1     0
3  name3     2     4
4  name4     9     2

In [236]:
# DataFrame from Nested Dictionaries

growth = {"Switzerland": {"2010": 3.0, "2011": 1.8, "2012": 1.1, "2013": 1.9},
          "Germany": {"2010": 4.1, "2011": 3.6, "2012":	0.4, "2013": 0.1},
          "France": {"2010":2.0,  "2011":2.1, "2012": 0.3, "2013": 0.3},
          "Greece": {"2010":-5.4, "2011":-8.9, "2012":-6.6, "2013":	-3.3},
          "Italy": {"2010":1.7, "2011":	0.6, "2012":-2.3, "2013":-1.9}
          } 

growth_frame = pd.DataFrame(growth)
print( growth_frame )
print( growth_frame.T )

      Switzerland  Germany  France  Greece  Italy
2010          3.0      4.1     2.0    -5.4    1.7
2011          1.8      3.6     2.1    -8.9    0.6
2012          1.1      0.4     0.3    -6.6   -2.3
2013          1.9      0.1     0.3    -3.3   -1.9
             2010  2011  2012  2013
Switzerland   3.0   1.8   1.1   1.9
Germany       4.1   3.6   0.4   0.1
France        2.0   2.1   0.3   0.3
Greece       -5.4  -8.9  -6.6  -3.3
Italy         1.7   0.6  -2.3  -1.9

### 3. Accessing and Changing values of DataFrames

In [294]:
first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 'data scientist', 'accountant', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Brainfuck')

df = pd.DataFrame(zip(last, job, language), columns=['last', 'job', 'language'], index=first)
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant      Cobol
Kate       Mair        psychiatrist  Brainfuck

In [295]:
# changing values in DataFrame

print(df.loc['Bill', 'job'])
print(df.at['Bill', 'job'])

df.loc['Bill', 'job'] = 'data analyst'
df.at['Pete', 'language'] = 'Angular'
df

data scientist
data scientist

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer        data analyst       Java
Pete       Meyr          accountant    Angular
Kate       Mair        psychiatrist  Brainfuck

In [331]:
# replace

df.replace(["Java", "Perl"], "JavaScript", inplace=True)
print( df , "\n")

new_df = df.replace(to_replace=['Mike', 'Tom', 'Angular'], value= ['Michael', 'Thomas', 'Python'])
print( new_df)

           last                 job    language
Mike      Meyer        data analyst      Python
Dorothee  Maier          programmer  JavaScript
Tom       Meyer  computer scientist  JavaScript
Bill      Mayer        data analyst  JavaScript
Pete       Meyr          accountant     Angular
Kate       Mair        psychiatrist   Brainfuck

           last                 job    language
Mike      Meyer        data analyst      Python
Dorothee  Maier          programmer  JavaScript
Tom       Meyer  computer scientist  JavaScript
Bill      Mayer        data analyst  JavaScript
Pete       Meyr          accountant      Python
Kate       Mair        psychiatrist   Brainfuck

In [336]:
# to_replace can be a dict

df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': ['foo', 'bar', 'bloo', 'blee', 'bloo'],
                   'C': ['green', 'red', 'blue', 'yellow', 'green']})

df.replace(to_replace={"A": {0: 42, 3: 33}, 'B': {'bloo': 'vloo'}}, inplace=True)
df

    A     B       C
0  42   foo   green
1   1   bar     red
2   2  vloo    blue
3  33  blee  yellow
4   4  vloo   green

In [371]:
df = pd.DataFrame({
    'name':['Ben', 'Kate', 'Agnes', 'Ashleigh', 'Tom'],
    'job':['programmer', 'NN', 'NN', 'engineer', 'teacher'],
    'language':['Java', 'Python', 'LN', 'LN', 'C']})
print(df, "\n")

df = df.replace(to_replace='NN', value=None).ffill()
df = df.replace(to_replace="LN", value=None).bfill()
df

       name         job language
0       Ben  programmer     Java
1      Kate          NN   Python
2     Agnes          NN       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

       name         job language
0       Ben  programmer     Java
1      Kate  programmer   Python
2     Agnes  programmer        C
3  Ashleigh    engineer        C
4       Tom     teacher        C

### 4. Pandas Styling

In [373]:
# The .style property

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4.1234, 5.5678, 6.91011]})
styled_df = df.style.format({'B': "{:,.2f}"})
styled_df

In [384]:
df = pd.DataFrame({'Price': ['$1,234.57', '$9,876.43'], 'Discount': ['15%', '25%']})
df.style.format({'Price': '${:,.2f}', 'Discount':'{:.0%}' })
df

       Price Discount
0  $1,234.57      15%
1  $9,876.43      25%

In [385]:
df = pd.DataFrame({
    'First Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma'],
    'Weight (kg)': [68, 85, 74, 90, 62],
    'Height (cm)': [165, 180, 175, 185, 160],
    'IQ': [120, 135, 110, 145, 125]
})

styled_df = df.style.highlight_max(axis=0, color='lightgreen')

styled_df

In [393]:
df = pd.DataFrame({
    'Monday': [8.5, 7.2, 9.0, 6.8, 8.3],
    'Tuesday': [7.4, 8.1, 6.5, 9.2, 7.0],
    'Wednesday': [8.0, 9.3, 7.7, 8.1, 6.9],
    'Thursday': [6.2, 8.4, 9.1, 7.3, 8.5],
    'Friday': [7.3, 6.8, 8.2, 7.6, 9.1]
}, index=['Alice', 'Bob', 'Charlie', 'David', 'Emma'])

styled_df = df.style.highlight_max(axis=1, color='orange')
styled_df

In [425]:
# Applying a gradient

df.style.background_gradient(cmap='Blues')

In [427]:
df = pd.DataFrame({
    'Monday': [8.5, 5.2, 9.8, 6.1, 7.3],
    'Tuesday': [6.4, 8.7, 7.1, 9.0, 5.6],
    'Wednesday': [7.8, 9.5, 5.9, 8.3, 6.7],
    'Thursday': [5.6, 7.2, 9.3, 6.8, 8.9],
    'Friday': [9.1, 6.5, 8.0, 7.6, 9.4]
}, index=['Alice', 'Bob', 'Charlie', 'David', 'Emma'])

styled_columnwise_bar = df.style.bar(color='lightblue', axis=0)
styled_rowwise_bar = df.style.bar(color='lightgreen', width=90, axis=1)
styled_rowwise_bar

### 5. Pandas Pivot

In [433]:
data = {
    'Color': ['red', 'green', 'blue', 'red', 'green', 'blue'],
    'Number': ['one', 'two', 'one', 'two', 'one', 'two'],
    'Time': [345, 325, 898, 989, 23, 143],
    'Point': [1, 2, 3, 4, 5, 6]
}

df = pd.DataFrame(data)
df.loc[6] = ["red", "three", 100, 7]
df

   Color Number  Time  Point
0    red    one   345      1
1  green    two   325      2
2   blue    one   898      3
3    red    two   989      4
4  green    one    23      5
5   blue    two   143      6
6    red  three   100      7

In [435]:
df2 = df.pivot(index='Color', columns='Number')
df2

         Time               Point
Number    one  three    two   one three  two
Color
blue    898.0    NaN  143.0   3.0   NaN  6.0
green    23.0    NaN  325.0   5.0   NaN  2.0
red     345.0  100.0  989.0   1.0   7.0  4.0

In [437]:
df3 = df.pivot(index='Color',
               columns='Number',
               values=['Time', 'Point'])
df3

         Time               Point
Number    one  three    two   one three  two
Color
blue    898.0    NaN  143.0   3.0   NaN  6.0
green    23.0    NaN  325.0   5.0   NaN  2.0
red     345.0  100.0  989.0   1.0   7.0  4.0

In [439]:
df3 = df.pivot(index='Color',
               columns='Number',
               values=['Time'])
df3

         Time
Number    one  three    two
Color
blue    898.0    NaN  143.0
green    23.0    NaN  325.0
red     345.0  100.0  989.0

### 6. Pandas: groupby

In [448]:
nvalues = 30

values = np.random.randint(1, 20, (nvalues,))
fruits = ["bananas", "oranges", "apples", "clementines", "cherries", "pears"]
fruits_index = np.random.choice(fruits, (nvalues,))

s = pd.Series(values, index=fruits_index)
print(s, "\n\n")
grouped = s.groupby(s.index)

for fruit, s_obj in grouped:
    print(f"==== {fruit} =====")
    print(s_obj)

oranges         7
clementines     3
oranges        13
apples         19
cherries       14
pears           9
pears           9
cherries       14
apples         18
apples          5
bananas        17
bananas        11
bananas        11
oranges         6
pears          17
cherries       18
oranges        18
cherries       18
clementines    15
clementines     7
oranges        11
oranges        19
cherries        2
apples         10
apples          7
cherries       10
pears          13
bananas         5
pears           8
cherries        6
dtype: int64


==== apples =====
apples    19
apples    18
apples     5
apples    10
apples     7
dtype: int64
==== bananas =====
bananas    17
bananas    11
bananas    11
bananas     5
dtype: int64
==== cherries =====
cherries    14
cherries    14
cherries    18
cherries    18
cherries     2
cherries    10
cherries     6
dtype: int64
==== clementines =====
clementines     3
clementines    15
clementines     7
dtype: int64
==== oranges =====
oranges     7
oranges    13
oranges     6
oranges    18
oranges    11
oranges    19
dtype: int64
==== pears =====
pears     9
pears     9
pears    17
pears    13
pears     8
dtype: int64

In [468]:
# groupby with DataFrames

bevereages = pd.DataFrame({'Name': ['Robert', 'Melinda', 'Brenda',
                                   'Samantha', 'Melinda', 'Robert',
                                   'Melinda', 'Brenda', 'Samantha'],
                          'Coffee': [3, 0, 2, 2, 0, 2, 0, 1, 3],
                          'Tea':    [0, 4, 2, 0, 3, 0, 3, 2, 0]})
print( bevereages['Coffee'].sum(), "\n" )
print( bevereages[['Coffee', 'Tea']].sum(),"\n" )
print( bevereages.groupby(['Name']).sum(), "\n" )
print( bevereages.groupby(['Name']).mean() )

13

Coffee    13
Tea       14
dtype: int64

          Coffee  Tea
Name
Brenda         3    4
Melinda        0   10
Robert         5    0
Samantha       5    0

          Coffee       Tea
Name
Brenda       1.5  2.000000
Melinda      0.0  3.333333
Robert       2.5  0.000000
Samantha     2.5  0.000000

In [476]:
names = ('Ortwin', 'Mara', 'Siegrun', 'Sylvester', 'Metin', 'Adeline', 'Utz', 'Susan', 'Gisbert', 'Senol')
data = {'Monday': np.array([0, 9, 2, 3, 7, 3, 9, 2, 4, 9]),
        'Tuesday': np.array([2, 6, 3, 3, 5, 5, 7, 7, 1, 0]),
        'Wednesday': np.array([6, 1, 1, 9, 4, 0, 8, 6, 8, 8]),
        'Thursday': np.array([1, 8, 6, 9, 9, 4, 1, 7, 3, 2]),
        'Friday': np.array([3, 5, 6, 6, 5, 2, 2, 4, 6, 5]),
        'Saturday': np.array([8, 4, 8, 2, 3, 9, 3, 4, 9, 7]),
        'Sunday': np.array([0, 8, 7, 8, 9, 7, 2, 0, 5, 2])}

data_df = pd.DataFrame(data, index=names)
print(data_df, "\n\n")

def is_weekend(day):
    if day in ['Saturday', 'Sunday']: return 'Weekend'
    else: return "Workday"

for res_func, df in data_df.T.groupby(by=is_weekend):
    print(df)

           Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Ortwin          0        2          6         1       3         8       0
Mara            9        6          1         8       5         4       8
Siegrun         2        3          1         6       6         8       7
Sylvester       3        3          9         9       6         2       8
Metin           7        5          4         9       5         3       9
Adeline         3        5          0         4       2         9       7
Utz             9        7          8         1       2         3       2
Susan           2        7          6         7       4         4       0
Gisbert         4        1          8         3       6         9       5
Senol           9        0          8         2       5         7       2


          Ortwin  Mara  Siegrun  Sylvester  Metin  Adeline  Utz  Susan  \
Saturday       8     4        8          2      3        9    3      4
Sunday         0     8        7          8      9        7    2      0

          Gisbert  Senol
Saturday        9      7
Sunday          5      2
           Ortwin  Mara  Siegrun  Sylvester  Metin  Adeline  Utz  Susan  \
Monday          0     9        2          3      7        3    9      2
Tuesday         2     6        3          3      5        5    7      7
Wednesday       6     1        1          9      4        0    8      6
Thursday        1     8        6          9      9        4    1      7
Friday          3     5        6          6      5        2    2      4

           Gisbert  Senol
Monday           4      9
Tuesday          1      0
Wednesday        8      8
Thursday         3      2
Friday           6      5

In [508]:
d = {"products": ["Oppilume", "Dreaker", "Lotadilo", 
                  "Crosteron", "Wazzasoft", "Oppilume", 
                  "Dreaker", "Lotadilo", "Wazzasoft"],
     "colours": ["blue", "blue", "blue", 
                 "green", "blue", "green", 
                 "green", "green", "red"],
     "customer_price": [2345.89, 2390.50, 1820.00, 
                        3100.00, 1784.50, 2545.89,
                        2590.50, 2220.00, 2084.50],
     "non_customer_price": [2445.89, 2495.50, 1980.00, 
                            3400.00, 1921.00, 2645.89, 
                            2655.50, 2140.00, 2190.00]}

product_prices = pd.DataFrame(d)
product_prices.groupby(["products","colours"]).mean()

                   customer_price  non_customer_price
products  colours
Crosteron green           3100.00             3400.00
Dreaker   blue            2390.50             2495.50
          green           2590.50             2655.50
Lotadilo  blue            1820.00             1980.00
          green           2220.00             2140.00
Oppilume  blue            2345.89             2445.89
          green           2545.89             2645.89
Wazzasoft blue            1784.50             1921.00
          red             2084.50             2190.00

In [519]:
product_prices[['colours', 'customer_price', 'non_customer_price']].groupby('colours').sum()

         customer_price  non_customer_price
colours
blue            8340.89             8842.39
green          10456.39            10841.39
red             2084.50             2190.00

### 7. Pandas Groupby Example

In [543]:
data = pd.read_csv("https://python-course.eu/data/donations.txt", usecols=[2,3,4,5])
data

         city         job  income  donations
0   Karlsruhe  Politician  244400       2512
1    Freiburg     Student   16800        336
2     Hamburg    Engineer  116900       1479
3        Köln    Musician   57700       1142
4   Stuttgart    Engineer  109300       1592
..        ...         ...     ...        ...
95  Stuttgart     Manager  364300       1487
96  Stuttgart     Student   12800        256
97       Köln    Engineer  119300       1308
98  Karlsruhe  Politician  295600       3364
99   Freiburg    Engineer  100700       1288

[100 rows x 4 columns]

In [544]:
data_sum = data[["job", "income", "donations"]].groupby("job").sum().sort_values(by="donations")
data_sum

              income  donations
job
Student       372900       7458
Musician     1448700      24376
Engineer     2067200      25564
Politician   4118300      30758
Manager     12862600      87475

In [545]:
data_sum['relative'] = data_sum.donations * 100 / data_sum.income
data_sum.sort_values(by='relative')

              income  donations  relative
job
Manager     12862600      87475  0.680072
Politician   4118300      30758  0.746862
Engineer     2067200      25564  1.236649
Musician     1448700      24376  1.682612
Student       372900       7458  2.000000

In [551]:
df2 = data.groupby(['city', 'job']).count()
df2.drop(columns=['income'], inplace=True)
df2.rename(columns={'donations': 'number of people'})

                      number of people
city      job
Berlin    Engineer                   3
          Manager                    3
          Musician                   2
          Politician                 1
          Student                    2
Freiburg  Engineer                   3
          Manager                    5
          Musician                   3
          Politician                 3
          Student                    5
Hamburg   Engineer                   4
          Musician                   4
          Politician                 1
          Student                    2
Karlsruhe Engineer                   1
          Manager                    3
          Politician                 7
          Student                    2
Konstanz  Engineer                   2
          Manager                    5
          Musician                   3
          Politician                 4
          Student                    3
Köln      Engineer                   1
          Manager                    3
          Musician                   2
          Politician                 1
          Student                    3
Stuttgart Engineer                   4
          Manager                    4
          Musician                   4
          Politician                 3
          Student                    4

In [558]:
data[['city', 'job']].groupby(['city', 'job']).size()

city       job
Berlin     Engineer      3
           Manager       3
           Musician      2
           Politician    1
           Student       2
Freiburg   Engineer      3
           Manager       5
           Musician      3
           Politician    3
           Student       5
Hamburg    Engineer      4
           Musician      4
           Politician    1
           Student       2
Karlsruhe  Engineer      1
           Manager       3
           Politician    7
           Student       2
Konstanz   Engineer      2
           Manager       5
           Musician      3
           Politician    4
           Student       3
Köln       Engineer      1
           Manager       3
           Musician      2
           Politician    1
           Student       3
Stuttgart  Engineer      4
           Manager       4
           Musician      4
           Politician    3
           Student       4
dtype: int64

### 8.Reading and Writing Data in Pandas

In [567]:
exchange_rates = pd.read_csv(
    "https://python-course.eu/data1/dollar_euro.txt", 
    header=0,
    sep="\t",
    names=['year', 'min', 'max', 'days']
)
exchange_rates

          year       min       max  days
2016  0.901696  0.864379  0.959785   247
2015  0.901896  0.830358  0.947688   256
2014  0.753941  0.716692  0.823655   255
2013  0.753234  0.723903  0.783208   255
2012  0.778848  0.743273  0.827198   256
2011  0.719219  0.671953  0.775855   257
2010  0.755883  0.686672  0.837381   258
2009  0.718968  0.661376  0.796495   256
2008  0.683499  0.625391  0.802568   256
2007  0.730754  0.672314  0.775615   255
2006  0.797153  0.750131  0.845594   255
2005  0.805097  0.740357  0.857118   257
2004  0.804828  0.733514  0.847314   259
2003  0.885766  0.791766  0.963670   255
2002  1.060945  0.953562  1.165773   255
2001  1.117587  1.047669  1.192748   255
2000  1.085899  0.962649  1.211827   255
1999  0.939475  0.848176  0.998502   261

In [576]:
column_names = ["Country"] + list(range(2002, 2013))
column_names

male_pop = pd.read_csv("https://python-course.eu/data1/countries_male_population.csv", header=None, index_col=0, names=column_names)
female_pop = pd.read_csv("https://python-course.eu/data1/countries_female_population.csv", header=None, index_col=0, names=column_names)
population = male_pop + female_pop
population.to_csv("countries_total_population.csv")

,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012
Country,,,,,,,,,,,
Australia,19640979.0,19872646,20091504,20339759,20605488,21015042,21431781,21874920,22342398,22620554,22683573
Austria,8139310.0,8067289,8140122,8206524,8265925,8298923,8331930,8355260,8375290,8404252,8443018
Belgium,10309725.0,10355844,10396421,10445852,10511382,10584534,10666866,10753080,10839905,10366843,11035958
Canada,NaN,31361611,31372587,31989454,32299496,32649482,32927372,33327337,33334414,33927935,34492645
Czech Republic,10269726.0,10203269,10211455,10220577,10251079,10287189,10381130,10467542,10506813,10532770,10505445
Denmark,5368354.0,5383507,5397640,5411405,5427459,5447084,5475791,5511451,5534738,5560628,5580516
Finland,5194901.0,5206295,5219732,5236611,5255580,5276955,5300484,5326314,5351427,5375276,5401267
France,59337731.0,59630121,59900680,62518571,62998773,63392140,63753140,64366962,64716310,65129746,65394283
Germany,82440309.0,82536680,82531671,82500849,82437995,82314906,82217837,82002356,81802257,81751602,81843743
Greece,10988000.0,11006377,11040650,11082751,11125179,11171740,11213785,11260402,11305118,11309885,11290067
Hungary,10174853.0,10142362,10116742,10097549,10076581,10066158,10045401,10030975,10014324,9985722,9957731
Iceland,286575.0,288471,290570,293577,299891,307672,315459,319368,317630,318452,319575
Ireland,3882683.0,3963636,4027732,4109173,4209019,4239848,4401335,4450030,4467854,4569864,4582769
Italy,56993742.0,57321070,57888245,58462375,58751711,59131287,59619290,60045068,60340328,60626442,60820696
Japan,127291000.0,127435000,127620000,127687000,127767994,127770000,127771000,127692000,127510000,128057000,127799000
Korea,47639618.0,47925318,48082163,48138077,48297184,48456369,48606787,48746693,48874539,49779440,50004441
Luxembourg,444050.0,448300,451600,455000,469086,476187,483799,493500,502066,511840,524853
Mexico,101826249.0,103039964,104213503,103001871,103946866,104874282,105790725,106682518,107550697,108396211,115682867
Netherlands,16105285.0,16192572,16258032,16305526,16334210,16357992,16405399,16485787,16574989,16655799,16730348
New Zealand,3939130.0,4009200,4062500,4100570,4139470,4228280,4268880,4315840,4367740,4405150,4433100
Norway,4524066.0,4552252,4577457,4606363,4640219,4681134,4737171,4799252,4858199,4920305,4985870
Poland,38632453.0,38218531,38190608,38173835,38157055,38125479,38115641,38135876,38167329,38200037,38538447
Portugal,10335559.0,10407465,10474685,10529255,10569592,10599095,10617575,10627250,10637713,10636979,10542398
Slovak Republic,5378951.0,5379161,5380053,5384822,5389180,5393637,5400998,5412254,5424925,5435273,5404322
Spain,40409330.0,41550584,42345342,43038035,43758250,44474631,45283259,45828172,45989016,46152926,46818221
Sweden,8909128.0,8940788,8975670,9011392,9047752,9113257,9182927,9256347,9340682,9415570,9482855
Switzerland,7261210.0,7313853,7364148,7415102,7459128,7508739,7593494,7701856,7785806,7870134,7954662
Turkey,NaN,70171979,70689500,71607500,72519974,72519974,70586256,71517100,72561312,73722988,74724269
United Kingdom,58706905.0,59262057,59699828,60059858,60412870,60781346,61179260,61595094,62026962,62498612,63256154
United States,277244916.0,288774226,290810719,294442683,297308143,300184434,304846731,305127551,307756577,309989078,312232049

In [579]:
shop1 = {"foo":{2010:23, 2011:25}, "bar":{2010:13, 2011:29}}
shop2 = {"foo":{2010:223, 2011:225}, "bar":{2010:213, 2011:229}}

shop1 = pd.DataFrame(shop1)
shop2 = pd.DataFrame(shop2)
both_shops = shop1 + shop2
both_shops

shops = pd.concat([shop1, shop2], keys=["one", "two"])
shops

          foo  bar
one 2010   23   13
    2011   25   29
two 2010  223  213
    2011  225  229

In [580]:
pop_complete = pd.concat([population.T, 
                          male_pop.T,
                          female_pop.T], 
                          keys=["total", "male", "female"])
df = pop_complete.swaplevel()
df.sort_index(inplace=True)
df[["Austria", "Australia", "France"]]

Country        Austria   Australia      France
2002 female  4179743.0   9887846.0  30510073.0
     male    3959567.0   9753133.0  28827658.0
     total   8139310.0  19640979.0  59337731.0
2003 female  4158169.0   9999199.0  30655533.0
     male    3909120.0   9873447.0  28974588.0
     total   8067289.0  19872646.0  59630121.0
2004 female  4190297.0  10100991.0  30789154.0
     male    3949825.0   9990513.0  29111526.0
     total   8140122.0  20091504.0  59900680.0
2005 female  4220228.0  10218321.0  32147490.0
     male    3986296.0  10121438.0  30371081.0
     total   8206524.0  20339759.0  62518571.0
2006 female  4246571.0  10348070.0  32390087.0
     male    4019354.0  10257418.0  30608686.0
     total   8265925.0  20605488.0  62998773.0
2007 female  4261752.0  10570420.0  32587979.0
     male    4037171.0  10444622.0  30804161.0
     total   8298923.0  21015042.0  63392140.0
2008 female  4277716.0  10770864.0  32770860.0
     male    4054214.0  10660917.0  30982280.0
     total   8331930.0  21431781.0  63753140.0
2009 female  4287213.0  10986535.0  33208315.0
     male    4068047.0  10888385.0  31158647.0
     total   8355260.0  21874920.0  64366962.0
2010 female  4296197.0  11218144.0  33384930.0
     male    4079093.0  11124254.0  31331380.0
     total   8375290.0  22342398.0  64716310.0
2011 female  4308915.0  11359807.0  33598633.0
     male    4095337.0  11260747.0  31531113.0
     total   8404252.0  22620554.0  65129746.0
2012 female  4324983.0  11402769.0  33723892.0
     male    4118035.0  11280804.0  31670391.0
     total   8443018.0  22683573.0  65394283.0

### 9.

### 11.

### 11.